export interface DepositItem {
  id: number
  bank: string
  subtitle: string
  rate: string
  currency: string
  minSum: string
  term: string
  fullConditions?: string[]
}

export const DEPOSIT_LIST: DepositItem[] = [
  {
    id: 1,
    bank: 'Altyn Bank',
    subtitle: 'Вклад «Резерв»',
    rate: '14.5%',
    currency: 'KZT',
    minSum: 'от 10 000 ₸',
    term: '12 месяцев',
    fullConditions: [
      'Возможность пополнения вклада без ограничений по сумме',
      'Частичное снятие до суммы неснижаемого остатка (10 000 ₸)',
      'Автоматическая пролонгация договора на новый срок',
      'Депозит застрахован Казахстанским фондом гарантирования депозитов (КФГД)'
    ]
  },
  {
    id: 2,
    bank: 'Bank RBK',
    subtitle: 'Вклад «Safe Deposit»',
    rate: '14.0%',
    currency: 'KZT',
    minSum: 'от 15 000 ₸',
    term: '24 месяца',
    fullConditions: [
      'Пополнение без ограничений в течение всего срока',
      'Ежемесячная капитализация процентов',
      'Удобное управление в мобильном приложении',
      'Гарантия КФГД до 20 млн тенге'
    ]
  },
  {
    id: 3,
    bank: 'Halyk Bank',
    subtitle: 'Вклад «Максимальный»',
    rate: '14.8%',
    currency: 'KZT',
    minSum: 'от 20 000 ₸',
    term: '6 месяцев',
    fullConditions: [
      'Максимальная процентная ставка без права изъятия',
      'Выплата процентов в конце срока',
      'Быстрое открытие онлайн через приложение',
      'Защита государственным фондом КФГД'
    ]
  },
  {
    id: 4,
    bank: 'ForteBank',
    subtitle: 'Вклад «Forte Выгодный»',
    rate: '13.9%',
    currency: 'KZT',
    minSum: 'от 50 000 ₸',
    term: '12 месяцев',
    fullConditions: [
      'Гибкие условия пополнения и снятия',
      'Начисление процентов на ежедневный остаток',
      'Возможность мультивалютного разделения средств',
      'Страхование вкладов КФГД'
    ]
  },
  {
    id: 5,
    bank: 'Kaspi Bank',
    subtitle: 'Kaspi Депозит',
    rate: '14.0%',
    currency: 'KZT',
    minSum: 'от 1 000 ₸',
    term: '12 месяцев',
    fullConditions: [
      'Снятие и пополнение в любое время без потери процентов',
      'Минимальная сумма открытия всего от 1 000 ₸',
      'Моментальные переводы на Kaspi Gold',
      'Гарантировано КФГД'
    ]
  },
  {
    id: 6,
    bank: 'Банк ЦентрКредит',
    subtitle: 'Вклад «Рахмет»',
    rate: '14.2%',
    currency: 'KZT',
    minSum: 'от 10 000 ₸',
    term: '18 месяцев',
    fullConditions: [
      'Высокая эффективная ставка вознаграждения',
      'Ежемесячная выплата процентов на карту',
      'Автоматическое продление депозита',
      'Защита КФГД'
    ]
  }
]
